// 一级类目 商户类型
export const merchantsTypes = [
  '企业',
  '个体工商户',
  '政府及事业单位',
  '其他组织'
];

// 二级类目
export const segmenTypes = [
  ['餐饮', '线下零售', '网上购物', '居民生活/商业服务', '休闲娱乐', '交通出行/票务旅游', '网络媒体/计算机服务/游戏', '网上服务平台', '教育/医疗', '生活缴费', '金融', '收藏/拍卖', '其他'],
  ['餐饮', '线下零售', '居民生活/商业服务', '休闲娱乐', '交通运输服务', '网络媒体/计算机服务/游戏', '教育/医疗', '生活缴费', '金融', '交通出行/票务旅游', '其他'],
  ['教育/医疗', '交通运输服务', '其他生活缴费'],
  ['教育/医疗', '生活/咨询服务', '交通运输/票务旅游', '公益']
];

// 三级类目
export const concreteTypes  = [
  [
    [
      {
        "value": "快餐",
        "key": "545"
      },
      {
        "value": "火锅",
        "key": "543"
      },
      {
        "value": "烧烤",
        "key": "544"
      },
      {
        "value": "小吃/熟食",
        "key": "548"
      },
      {
        "value": "其他中餐",
        "key": "539"
      },
      {
        "value": "日韩/东南亚菜",
        "key": "541"
      },
      {
        "value": "西餐",
        "key": "540"
      },
      {
        "value": "咖啡厅",
        "key": "542"
      },
      {
        "value": "甜品饮品",
        "key": "550"
      },
      {
        "value": "烘焙糕点",
        "key": "549"
      },
    ],
    [
      {
        "value": "超市",
        "key": "204"
      },
      {
        "value": "便利店",
        "key": "205"
      },
      {
        "value": "百货",
        "key": "207"
      },
      {
        "value": "自动贩卖机",
        "key": "206"
      },
      {
        "value": "食品生鲜",
        "key": "270"
      },
      {
        "value": "数码电器/电脑办公",
        "key": "310"
      },
      {
        "value": "家具建材/家居厨具",
        "key": "266"
      },
      {
        "value": "服饰箱包",
        "key": "271"
      },
      {
        "value": "运动户外",
        "key": "6"
      },
      {
        "value": "美妆个护",
        "key": "267"
      },
      {
        "value": "母婴用品/儿童玩具",
        "key": "19"
      },
      {
        "value": "计生用品",
        "key": "13"
      },
      {
        "value": "黄金珠宝",
        "key": "9"
      },
      {
        "value": "礼品鲜花/农资绿植",
        "key": "272"
      },
      {
        "value": "宠物/宠物用品",
        "key": "284"
      },
      {
        "value": "钟表眼镜",
        "key": "268"
      },
      {
        "value": "批发业",
        "key": "585"
      },
      {
        "value": "图书音像/文具乐器",
        "key": "315"
      },
    ],
    [
      {
        "value": "线上商超",
        "key": "203"
      },
    ],
    [
      {
        "value": "物流/快递公司",
        "key": "70"
      },
      {
        "value": "家政/维修服务",
        "key": "311"
      },
      {
        "value": "婚庆/摄影",
        "key": "273"
      },
      {
        "value": "丧仪殡葬服务",
        "key": "564"
      },
      {
        "value": "搬家/回收",
        "key": "565"
      },
      {
        "value": "共享服务",
        "key": "538"
      },
      {
        "value": "宠物医院",
        "key": "566"
      },
      {
        "value": "苗木种植/园林绿化",
        "key": "317"
      },
      {
        "value": "装饰/设计",
        "key": "289"
      },
      {
        "value": "广告/会展/活动策划",
        "key": "312"
      },
      {
        "value": "咨询/法律咨询/金融咨询等",
        "key": "42"
      },
      {
        "value": "人才中介机构/招聘/猎头",
        "key": "93"
      },
      {
        "value": "职业社交/婚介/交友",
        "key": "94"
      },
      {
        "value": "房地产",
        "key": "316"
      },
    ],
    [
      {
        "value": "娱乐票务",
        "key": "281"
      },
      {
        "value": "院线影城",
        "key": "572"
      },
      {
        "value": "演出赛事",
        "key": "573"
      },
      {
        "value": "运动健身场馆",
        "key": "54"
      },
      {
        "value": "美发/美容/美甲店",
        "key": "574"
      },
      {
        "value": "俱乐部/休闲会所",
        "key": "280"
      },
      {
        "value": "游艺厅/KTV/网吧",
        "key": "56"
      },
      {
        "value": "酒吧",
        "key": "571"
      }
    ],
    [
      {
        "value": "租车",
        "key": "77"
      },
      {
        "value": "机票/机票代理",
        "key": "274"
      },
      {
        "value": "铁路客运",
        "key": "283"
      },
      {
        "value": "高速收费",
        "key": "610"
      },
      {
        "value": "城市公共交通",
        "key": "288"
      },
      {
        "value": "加油",
        "key": "259"
      },
      {
        "value": "停车缴费",
        "key": "287"
      },
      {
        "value": "汽车用品",
        "key": "269"
      },
      {
        "value": "汽车美容/维修保养",
        "key": "563"
      },
      {
        "value": "船舶/海运服务",
        "key": "75"
      },
      {
        "value": "景区",
        "key": "354"
      },
      {
        "value": "旅馆/酒店/度假区",
        "key": "275"
      },
      {
        "value": "旅行社",
        "key": "23"
      }
    ],
    [
      {
        "value": "在线图书/视频/音乐",
        "key": "276"
      },
      {
        "value": "门户/资讯/论坛",
        "key": "104"
      },
      {
        "value": "游戏",
        "key": "501"
      },
      {
        "value": "网络直播",
        "key": "521"
      },
      {
        "value": "软件/建站/技术开发",
        "key": "277"
      },
      {
        "value": "网络推广/网络广告",
        "key": "278"
      }
    ],
    [
      {
        "value": "团购服务平台",
        "key": "2"
      },
      {
        "value": "综合生活服务平台",
        "key": "95"
      },
      {
        "value": "旅游服务平台",
        "key": "24"
      },
      {
        "value": "订餐服务平台",
        "key": "522"
      }
    ],
    [
      {
        "value": "教育/培训/考试缴费/学费",
        "key": "52"
      },
      {
        "value": "私立院校",
        "key": "53"
      },
      {
        "value": "保健器械/医疗器械/非处方药品",
        "key": "314"
      },
      {
        "value": "保健信息咨询平台",
        "key": "282"
      },
      {
        "value": "私立/民营医院/诊所",
        "key": "66"
      },
      {
        "value": "挂号平台",
        "key": "67"
      }
    ],
    [
      {
        "value": "电信运营商",
        "key": "80"
      },
      {
        "value": "宽带收费",
        "key": "81"
      },
      {
        "value": "话费通讯",
        "key": "92"
      },
      {
        "value": "有线电视缴费",
        "key": "58"
      },
      {
        "value": "物业管理费",
        "key": "60"
      },
      {
        "value": "水电煤缴费/交通罚款等生活缴费",
        "key": "57"
      },
      {
        "value": "其他生活缴费",
        "key": "62"
      }
    ],
    [
      {
        "value": "财经资讯",
        "key": "96"
      },
      {
        "value": "股票软件类",
        "key": "97"
      },
      {
        "value": "保险业务",
        "key": "318"
      },
      {
        "value": "众筹",
        "key": "112"
      },
      {
        "value": "信用还款",
        "key": "326"
      }
    ],
    [
      {
        "value": "非文物类收藏品",
        "key": "31"
      },
      {
        "value": "文物经营/文物复制品销售",
        "key": "285"
      },
      {
        "value": "拍卖/典当",
        "key": "325"
      }
    ],
    [
      {
        "value": "其他行业",
        "key": "111"
      }
    ]
  ],
  [
    [
      {
        "value": "快餐",
        "key": "557"
      },
      {
        "value": "火锅",
        "key": "555"
      },
      {
        "value": "烧烤",
        "key": "556"
      },
      {
        "value": "小吃/熟食",
        "key": "560"
      },
      {
        "value": "其他中餐",
        "key": "551"
      },
      {
        "value": "日韩/东南亚菜",
        "key": "553"
      },
      {
        "value": "西餐",
        "key": "552"
      },
      {
        "value": "咖啡厅",
        "key": "554"
      },
      {
        "value": "甜品饮品",
        "key": "562"
      },
      {
        "value": "烘焙糕点",
        "key": "561"
      },
    ],
    [
      {
        "value": "便利店",
        "key": "209"
      },
      {
        "value": "食品生鲜",
        "key": "292"
      },
      {
        "value": "数码电器/电脑办公",
        "key": "319"
      },
      {
        "value": "家具建材/家居厨具",
        "key": "293"
      },
      {
        "value": "服饰箱包",
        "key": "297"
      },
      {
        "value": "运动户外",
        "key": "116"
      },
      {
        "value": "美妆个护",
        "key": "294"
      },
      {
        "value": "母婴用品/儿童玩具",
        "key": "129"
      },
      {
        "value": "计生用品",
        "key": "123"
      },
      {
        "value": "图书音像/文具乐器",
        "key": "323"
      },
      {
        "value": "钟表眼镜",
        "key": "298"
      },
      {
        "value": "宠物/宠物用品",
        "key": "305"
      },
      {
        "value": "礼品鲜花/农资绿植",
        "key": "295"
      },
      {
        "value": "批发业",
        "key": "585"
      },
    ],
    [
      {
        "value": "婚庆/摄影",
        "key": "299"
      },
      {
        "value": "丧仪殡葬服务",
        "key": "568"
      },
      {
        "value": "搬家/回收",
        "key": "569"
      },
      {
        "value": "宠物医院",
        "key": "570"
      },
      {
        "value": "咨询/法律咨询/金融咨询等",
        "key": "143"
      },
      {
        "value": "装饰/设计",
        "key": "306"
      },
      {
        "value": "家政/维修服务",
        "key": "320"
      },
      {
        "value": "广告/会展/活动策划",
        "key": "321"
      },
      {
        "value": "职业社交/婚介/交友",
        "key": "157"
      },
      {
        "value": "苗木种植/园林绿化",
        "key": "324"
      },
    ],
    [
      {
        "value": "娱乐票务",
        "key": "307"
      },
      {
        "value": "院线影城",
        "key": "578"
      },
      {
        "value": "演出赛事",
        "key": "579"
      },
      {
        "value": "运动健身场馆",
        "key": "148"
      },
      {
        "value": "美发/美容/美甲店",
        "key": "580"
      },
      {
        "value": "俱乐部/休闲会所",
        "key": "300"
      },
      {
        "value": "游艺厅/KTV/网吧",
        "key": "149"
      },
      {
        "value": "酒吧",
        "key": "577"
      }
    ],
    [
      {
        "value": "汽车用品",
        "key": "296"
      },
      {
        "value": "汽车美容/维修保养",
        "key": "267"
      }
    ],
    [
      {
        "value": "游戏",
        "key": "502"
      },
      {
        "value": "软件/建站/技术开发",
        "key": "302"
      },
      {
        "value": "网络推广/网络广告",
        "key": "303"
      }
    ],
    [
      {
        "value": "教育/培训/考试缴费/学费",
        "key": "147"
      },
      {
        "value": "保健器械/医疗器械/非处方药品",
        "key": "322"
      },
      {
        "value": "私立/民营医院/诊所",
        "key": "230"
      }
    ],
    [
      {
        "value": "话费通讯",
        "key": "155"
      },
      {
        "value": "生活缴费",
        "key": "309"
      }
    ],
    [
      {
        "value": "财经资讯",
        "key": "242"
      }
    ],
    [
      {
        "value": "旅馆/酒店/度假区",
        "key": "301"
      },
      {
        "value": "股票软件类",
        "key": "308"
      },
      {
        "value": "加油",
        "key": "340"
      }
    ],
    [
      {
        "value": "其他行业",
        "key": "158"
      }
    ]
  ],
  [
    [
      {
        "value": "公立院校",
        "key": "164"
      },
      {
        "value": "公立医院",
        "key": "176"
      },
      {
        "value": "挂号平台",
        "key": "177"
      }
    ],
    [
      {
        "value": "停车缴费",
        "key": "290"
      }
    ],
    [
      {
        "value": "水电煤缴费/交通罚款等生活缴费",
        "key": "165"
      },
      {
        "value": "事业单位",
        "key": "167"
      },
      {
        "value": "物业管理费",
        "key": "170"
      },
      {
        "value": "其他生活缴费",
        "key": "172"
      },
    ]
  ],
  [
    [
      {
        "value": "教育/培训/考试缴费/学费",
        "key": "506"
      },
      {
        "value": "私立院校",
        "key": "517"
      },
      {
        "value": "诊所/卫生站/卫生服务中心",
        "key": "534"
      }
    ],
    [
      {
        "value": "咨询/法律咨询/金融咨询等",
        "key": "523"
      }
    ],
    [
      {
        "value": "宗教",
        "key": "509"
      },
      {
        "value": "娱乐票务",
        "key": "535"
      },
      {
        "value": "机票/机票代理",
        "key": "537"
      }
    ],
    [
      {
        "value": "公益",
        "key": "510"
      }
    ]
  ]
];

// 微信商户mcc级联
const MerchantsWeChatPayMccOptions:any = [];

merchantsTypes.forEach((merchantsType, pIdx) => {
  MerchantsWeChatPayMccOptions.push({
    label: merchantsType,
    value: merchantsType,
    children: segmenTypes[pIdx].map((segmenType, cIdx) => ({
      label: segmenType,
      value: segmenType,
      children: (concreteTypes[pIdx][cIdx] || []).map((concreteType) => ({
        label: concreteType.value,
        value: concreteType.key
      }))
    }))
  })
});

export default MerchantsWeChatPayMccOptions;
